esp8266/Arduino/hardware/arduino/sam/system/CMSIS/Device/ATMEL/sam3s/svd/SAM3S4C.svd
        <register>
          <name>TNCR</name>
          <description>Transmit Next Counter Register</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXNCTR</name>
              <description>Transmit Counter Next</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTCR</name>
          <description>Transfer Control Register</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXTEN</name>
              <description>Receiver Transfer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXTDIS</name>
              <description>Receiver Transfer Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXTEN</name>
              <description>Transmitter Transfer Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXTDIS</name>
              <description>Transmitter Transfer Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTSR</name>
          <description>Transfer Status Register</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXTEN</name>
              <description>Receiver Transfer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXTEN</name>
              <description>Transmitter Transfer Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SSC</name>
      <version>6078J</version>
      <description>Synchronous Serial Controller</description>
      <prependToName>SSC_</prependToName>
      <baseAddress>0x40004000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ID_SSC</name>
        <value>22</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXEN</name>
              <description>Receive Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXDIS</name>
              <description>Receive Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXEN</name>
              <description>Transmit Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXDIS</name>
              <description>Transmit Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMR</name>
          <description>Clock Mode Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCMR</name>
          <description>Receive Clock Mode Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CKS</name>
              <description>Receive Clock Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>Divided Clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TK</name>
                  <description>TK Clock signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RK</name>
                  <description>RK pin</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKO</name>
              <description>Receive Clock Output Mode Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous Receive Clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER</name>
                  <description>Receive Clock only during data transfers</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKI</name>
              <description>Receive Clock Inversion</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKG</name>
              <description>Receive Clock Gating Selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous Receive Clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER</name>
                  <description>Receive Clock only during data transfers</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Receive Start Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSMIT</name>
                  <description>Transmit start</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_LOW</name>
                  <description>Detection of a low level on RF signal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_HIGH</name>
                  <description>Detection of a high level on RF signal</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_FALLING</name>
                  <description>Detection of a falling edge on RF signal</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_RISING</name>
                  <description>Detection of a rising edge on RF signal</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_LEVEL</name>
                  <description>Detection of any level change on RF signal</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_EDGE</name>
                  <description>Detection of any edge on RF signal</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP_0</name>
                  <description>Compare 0</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP</name>
              <description>Receive Stop Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STTDLY</name>
              <description>Receive Start Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIOD</name>
              <description>Receive Period Divider Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFMR</name>
          <description>Receive Frame Mode Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATLEN</name>
              <description>Data Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOP</name>
              <description>Loop Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBF</name>
              <description>Most Significant Bit First</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATNB</name>
              <description>Data Number per Frame</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSLEN</name>
              <description>Receive Frame Sync Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSOS</name>
              <description>Receive Frame Sync Output Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGATIVE</name>
                  <description>Negative Pulse</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POSITIVE</name>
                  <description>Positive Pulse</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Driven Low during data transfer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Driven High during data transfer</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLING</name>
                  <description>Toggling at each start of data transfer</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSEDGE</name>
              <description>Frame Sync Edge Detection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POSITIVE</name>
                  <description>Positive Edge Detection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGATIVE</name>
                  <description>Negative Edge Detection</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSLEN_EXT</name>
              <description>FSLEN Field Extension</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCMR</name>
          <description>Transmit Clock Mode Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CKS</name>
              <description>Transmit Clock Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>Divided Clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TK</name>
                  <description>TK Clock signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RK</name>
                  <description>RK pin</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKO</name>
              <description>Transmit Clock Output Mode Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous Receive Clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER</name>
                  <description>Transmit Clock only during data transfers</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKI</name>
              <description>Transmit Clock Inversion</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKG</name>
              <description>Transmit Clock Gating Selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Transmit Clock enabled only if TF Low</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER</name>
                  <description>Transmit Clock enabled only if TF High</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Transmit Start Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous, as soon as a word is written in the SSC_THR Register (if Transmit is enabled), and immediately after the end of transfer of the previous data.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECEIVE</name>
                  <description>Receive start</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_LOW</name>
                  <description>Detection of a low level on TF signal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_HIGH</name>
                  <description>Detection of a high level on TF signal</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_FALLING</name>
                  <description>Detection of a falling edge on TF signal</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_RISING</name>
                  <description>Detection of a rising edge on TF signal</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_LEVEL</name>
                  <description>Detection of any level change on TF signal</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_EDGE</name>
                  <description>Detection of any edge on TF signal</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP_0</name>
                  <description>Compare 0</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STTDLY</name>
              <description>Transmit Start Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIOD</name>
              <description>Transmit Period Divider Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
