esp8266/Arduino/hardware/arduino/sam/system/CMSIS/Device/ATMEL/sam3s/svd/SAM3S4C.svd
        <register>
          <name>MODE2</name>
          <description>SMC Mode Register (CS_number = 2)</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000003</resetValue>
          <fields>
            <field>
              <name>READ_MODE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_MODE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXNW_MODE</name>
              <description>NWAIT Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FROZEN</name>
                  <description>Frozen Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>Ready Mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBW</name>
              <description>Data Bus Width</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8_BIT</name>
                  <description>8-bit bus</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16_BIT</name>
                  <description>16-bit bus</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_BIT</name>
                  <description>32-bit bus</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDF_CYCLES</name>
              <description>Data Float Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDF_MODE</name>
              <description>TDF Optimization</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMEN</name>
              <description>Page Mode Enabled</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PS</name>
              <description>Page Size</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4_BYTE</name>
                  <description>4-byte page</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_BYTE</name>
                  <description>8-byte page</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16_BYTE</name>
                  <description>16-byte page</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_BYTE</name>
                  <description>32-byte page</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP3</name>
          <description>SMC Setup Register (CS_number = 3)</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>NWE_SETUP</name>
              <description>NWE Setup Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_WR_SETUP</name>
              <description>NCS Setup Length in WRITE Access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRD_SETUP</name>
              <description>NRD Setup Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_RD_SETUP</name>
              <description>NCS Setup Length in READ Access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PULSE3</name>
          <description>SMC Pulse Register (CS_number = 3)</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>NWE_PULSE</name>
              <description>NWE Pulse Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_WR_PULSE</name>
              <description>NCS Pulse Length in WRITE Access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRD_PULSE</name>
              <description>NRD Pulse Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_RD_PULSE</name>
              <description>NCS Pulse Length in READ Access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CYCLE3</name>
          <description>SMC Cycle Register (CS_number = 3)</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00030003</resetValue>
          <fields>
            <field>
              <name>NWE_CYCLE</name>
              <description>Total Write Cycle Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRD_CYCLE</name>
              <description>Total Read Cycle Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE3</name>
          <description>SMC Mode Register (CS_number = 3)</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000003</resetValue>
          <fields>
            <field>
              <name>READ_MODE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_MODE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXNW_MODE</name>
              <description>NWAIT Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FROZEN</name>
                  <description>Frozen Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>Ready Mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBW</name>
              <description>Data Bus Width</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8_BIT</name>
                  <description>8-bit bus</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16_BIT</name>
                  <description>16-bit bus</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_BIT</name>
                  <description>32-bit bus</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDF_CYCLES</name>
              <description>Data Float Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDF_MODE</name>
              <description>TDF Optimization</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMEN</name>
              <description>Page Mode Enabled</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PS</name>
              <description>Page Size</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4_BYTE</name>
                  <description>4-byte page</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_BYTE</name>
                  <description>8-byte page</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16_BYTE</name>
                  <description>16-byte page</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_BYTE</name>
                  <description>32-byte page</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP4</name>
          <description>SMC Setup Register (CS_number = 4)</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>NWE_SETUP</name>
              <description>NWE Setup Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_WR_SETUP</name>
              <description>NCS Setup Length in WRITE Access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRD_SETUP</name>
              <description>NRD Setup Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_RD_SETUP</name>
              <description>NCS Setup Length in READ Access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PULSE4</name>
          <description>SMC Pulse Register (CS_number = 4)</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>NWE_PULSE</name>
              <description>NWE Pulse Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_WR_PULSE</name>
              <description>NCS Pulse Length in WRITE Access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRD_PULSE</name>
              <description>NRD Pulse Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_RD_PULSE</name>
              <description>NCS Pulse Length in READ Access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CYCLE4</name>
          <description>SMC Cycle Register (CS_number = 4)</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00030003</resetValue>
          <fields>
            <field>
              <name>NWE_CYCLE</name>
              <description>Total Write Cycle Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRD_CYCLE</name>
              <description>Total Read Cycle Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE4</name>
          <description>SMC Mode Register (CS_number = 4)</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000003</resetValue>
          <fields>
            <field>
              <name>READ_MODE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_MODE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXNW_MODE</name>
              <description>NWAIT Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FROZEN</name>
                  <description>Frozen Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>Ready Mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBW</name>
              <description>Data Bus Width</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8_BIT</name>
                  <description>8-bit bus</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16_BIT</name>
                  <description>16-bit bus</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_BIT</name>
                  <description>32-bit bus</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDF_CYCLES</name>
              <description>Data Float Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDF_MODE</name>
              <description>TDF Optimization</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMEN</name>
              <description>Page Mode Enabled</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PS</name>
              <description>Page Size</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4_BYTE</name>
                  <description>4-byte page</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_BYTE</name>
                  <description>8-byte page</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16_BYTE</name>
                  <description>16-byte page</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_BYTE</name>
                  <description>32-byte page</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMS</name>
          <description>SMC OCMS MODE Register</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SMSE</name>
              <description>Static Memory Controller Scrambling Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS0SE</name>
              <description>Chip Select (x = 0 to 3) Scrambling Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS1SE</name>
              <description>Chip Select (x = 0 to 3) Scrambling Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS2SE</name>
              <description>Chip Select (x = 0 to 3) Scrambling Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS3SE</name>
              <description>Chip Select (x = 0 to 3) Scrambling Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1</name>
          <description>SMC OCMS KEY1 Register</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY1</name>
              <description>Off Chip Memory Scrambling (OCMS) Key Part 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2</name>
          <description>SMC OCMS KEY2 Register</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY2</name>
              <description>Off Chip Memory Scrambling (OCMS) Key Part 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
